---
type: OffsetSurface
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# OffsetSurface

`Autodesk.Revit.DB.OffsetSurface` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetBasisSurface | 2021 | `public Surface GetBasisSurface ()` |
| Method | GetOffsetDistance | 2021 | `public double GetOffsetDistance ()` |
| Method | IsOrientationSameAsBasisSurface | 2021 | `public bool IsOrientationSameAsBasisSurface ()` |